row = int(input("몇 행: "))
col = int(input("몇 열: "))


# ================================================
for i in range(row):
    print(" * " * (i + 1), end="")
    j = col
    for j in range(col - (i + 1), 0, -1):
        print(" . ", end="")
    print("\n")

print("\n==========================================\n")

# ================================================
for i in range(row):
    print(" . " * i, end="")
    j = col
    for j in range(col - i, 0, -1):
        print(" * ", end="")
    print("\n")

print("\n==========================================\n")

# ================================================
